In [1]:
import pandas as pd

# 1) Read Datasets

In [2]:
movie = pd.read_csv("data/movies.csv")
movie.columns

Index(['movieId', 'title', 'genre'], dtype='object')

In [3]:
movie.head()

,movieId,title,genre
0,8,Edison Kinetoscopic Record of a Sneeze (1894),Documentary|Short
1,10,La sortie des usines Lumière (1895),Documentary|Short
2,12,The Arrival of a Train (1896),Documentary|Short
3,25,The Oxford and Cambridge University Boat Race ...,NaN
4,91,Le manoir du diable (1896),Short|Horror

In [4]:
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37342 entries, 0 to 37341
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  37342 non-null  int64
 1   title    37342 non-null  object
 2   genre    34469 non-null  object
dtypes: int64(1), object(2)
memory usage: 875.3+ KB

In [5]:
# what we need is that movie id and title
movie = movie.loc[:,["movieId", "title"]] #drop other columns
movie.head()

   movieId                                              title
0        8      Edison Kinetoscopic Record of a Sneeze (1894)
1       10                La sortie des usines Lumière (1895)
2       12                      The Arrival of a Train (1896)
3       25  The Oxford and Cambridge University Boat Race ...
4       91                         Le manoir du diable (1896)

In [7]:
# import rating data and look at columsn
rating = pd.read_csv("data/ratings.csv")
rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 906831 entries, 0 to 906830
Data columns (total 3 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   userId   906831 non-null  int64
 1   movieId  906831 non-null  int64
 2   rating   906831 non-null  int64
dtypes: int64(3)
memory usage: 20.8 MB

In [8]:
rating.head()

   userId  movieId  rating
0       1   114508       8
1       2   499549       9
2       2  1305591       8
3       2  1428538       1
4       3    75314       1

# 2-Merge Datasets

In [9]:
# then merge movie and rating data
data = pd.merge(movie, rating)
data.head()

   movieId                                              title  userId  rating
0        8      Edison Kinetoscopic Record of a Sneeze (1894)   42898       5
1       10                La sortie des usines Lumière (1895)   70577      10
2       12                      The Arrival of a Train (1896)   69535      10
3       25  The Oxford and Cambridge University Boat Race ...   37628       8
4       91                         Le manoir du diable (1896)    5814       6

In [10]:
data.shape

(908634, 4)

In [12]:
data = data.iloc[:20000]

Örneğin 3. ve 5. userları karşılaştıracağız ve bunların zevkleri, izledikleri filmler uyuşuyor mu kontrol edeceğiz.

In [13]:
pivot_table = data.pivot_table(index = ["userId"], columns = ["title"], values = "rating") # satırları user, sütunları movie yapılır.
pivot_table.head()

title,...A Valparaíso (1963),...Un ami viendra ce soir... (1946),12 Angry Men (1957),12 to the Moon (1960),13 Frightened Girls! (1963),13 Ghosts (1960),13 Rue Madeleine (1947),1984 (1956),20 Million Miles to Earth (1957),"20,000 Leagues Under the Sea (1916)",...,Zoku Miyamoto Musashi,Zombies of Mora Tau (1957),Zotz! (1962),Zulu (1964),Zéro de conduite,À bout de souffle (1960),À nous la liberté (1931),À propos de Nice (1930),Ça va barder (1955),Él (1953)
userId,,,,,,,,,,,,,,,,,,,,,
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
58,NaN,NaN,9.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
66,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
95,NaN,NaN,10.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### SORU: "Usual Suspects, The (1995)" Filmini seven bir kişi için hangi filmleri önerebiliriz?

In [16]:
movie_watched = pivot_table["12 Angry Men (1957)"]
# corr 1'e yakınsa doğru orantılı, 0 ise benzemiyor, -1 ise ters orantılı
similarity_with_other_movies = pivot_table.corrwith(movie_watched)  # find correlation between "Usual Suspects, The (1995)" and other movies
similarity_with_other_movies = similarity_with_other_movies.sort_values(ascending=False) # Descending
similarity_with_other_movies.head()

C:\Users\Pointo2\anaconda3\lib\site-packages\numpy\lib\function_base.py:2634: RuntimeWarning: Degrees of freedom <= 0 for slice
  c = cov(x, y, rowvar, dtype=dtype)
C:\Users\Pointo2\anaconda3\lib\site-packages\numpy\lib\function_base.py:2493: RuntimeWarning: divide by zero encountered in true_divide
  c *= np.true_divide(1, fact)

title
Carmen Jones (1954)             1.0
The Fly (1958)                  1.0
Inherit the Wind (1960)         1.0
Divorzio all'italiana (1961)    1.0
L'eclisse (1962)                1.0
dtype: float64